backend/controllers/CustomerController.php

    public function actionView($id)
    {

        $mod = PlotOwnerInfo::find()->where(['customer_id' => $id])->andwhere(['organization_id' => \Yii::$app->user->identity->organization_id])->One();
        $prop_name = Property::find()->where(['property_id' => $mod->property_id])->andwhere(['organization_id' => \Yii::$app->user->identity->organization_id])->One();
---
SELECT * FROM `plot_owner_info` WHERE (`customer_id`='87') AND (`organization_id`=1)
SELECT * FROM `property` WHERE (`property_id`=20) AND (`organization_id`=1)

    protected function findModel($id)
    {
        if (($model = Customer::findOne($id)) !== null) {
---
SELECT * FROM `customer` WHERE `customer_id`='87'