backend/controllers/InstallmentPaymentController.php

SELECT * FROM `property` WHERE (`property_id`=24) AND (`organization_id`=1)
---
    public function actionProperty($customer_id)
    {

        $mod = InstallmentPayment::find()->select('property_id')->distinct()->where(['customer_id' => $customer_id])->andWhere(['organization_id' => \Yii::$app->user->identity->organization_id])->all();
        if($mod){
            echo "<option>SELECT A VALUE</option>";
        foreach ($mod as  $value) {
              $property = Property::find()->where(['property_id'=> $value->property_id])->andwhere(['organization_id' => \Yii::$app->user->identity->organization_id])->One();