backend/controllers/PropertyController.php

    public function actionGetPropertyId($property_id)
    {
        $property_id=$property_id;
        $record=Property::findOne(['property_id'=>$property_id]);
---
SELECT * FROM `property` WHERE `property_id`='23'

    public function actionCreate()
    {
        $request = Yii::$app->request;
        $model = new Property();
        $model->created_at = date("Y-m-d");
        $model->created_by = \Yii::$app->user->identity->username;
        $user=User::findone(["username"=>\Yii::$app->user->identity->username]);
        $organization=Organization::findone(["user_id"=>$user->id]);
---
SELECT * FROM `user` WHERE `username`='Usama'
SELECT * FROM `organization` WHERE `user_id`=1