backend/controllers/ServicesTypeController.php

    public function actionCreate()
    {
        $request = Yii::$app->request;
        $model = new ServicesType();

        $model->organization_id =  \Yii::$app->user->identity->organization_id;

        if($request->isAjax){
            /*
            *   Process for ajax request
            */
            Yii::$app->response->format = Response::FORMAT_JSON;
            if($request->isGet){
                return [
                    'title'=> "Create new ServicesType",
                    'content'=>$this->renderAjax('create', [
                        'model' => $model,
                    ]),
                    'footer'=> Html::button('Close',['class'=>'btn btn-default pull-left','data-dismiss'=>"modal"]).
                                Html::button('Save',['class'=>'btn btn-primary','type'=>"submit"])

                ];
            }else if($model->load($request->post()) && $model->save()){
---
INSERT INTO `services_type` (`organization_id`, `services_type`) VALUES (1, 'plumber')