backend/views/plot/index.php

SELECT * FROM `plot` WHERE `property_id`='24'
---
            $no_plots=$_POST['no_plots'];
            $property=Property::find()->where(['property_id'=>$selected_id])->one();
           $condition=["property_id"=>$selected_id];
            $rows=Plot::find()->where(["property_id"=>$selected_id])->all();