backend/views/plot/load.php

	?>
	<?php

$row=Plot::findOne(["plot_no"=>$plotno,"property_id"=>$property_id]);
$property=Property::findone(["property_id"=>$property_id]);
---
SELECT * FROM `plot` WHERE (`plot_no`='1') AND (`property_id`='24')
SELECT * FROM `property` WHERE `property_id`='24'