backend/views/plot/updaterecord.php

UPDATE `plot` SET `plot_length`='120', `plot_width`='120', `plot_price`=12000, `per_merla_rate`=10000, `plot_type`='Commercial', `status`='Unsold' WHERE (`plot_no`='1') AND (`property_id`='24')
---
			$permerla=$_GET['permerla'];
			$type=$_GET['type'];
			$status=$_GET['status'];
			$query=$connection->createCommand()->Update('plot',
				[
					'plot_length'=>$length,
					'plot_width'=>$width,
					'plot_price'=>$price,
					'per_merla_rate'=>$permerla,
					'plot_type'=>$type,
					'status'=>$status,
				],
				[
					'plot_no'=>$plotno,
					'property_id'=>$propertyid,
				]
			)->execute();