backend/views/services-details/_form.php

SELECT * FROM `services_type` WHERE `organization_id`=1
---
    <?= $form->field($model, 'address')->textInput(['maxlength' => true]) ?>


<?= $form->field($model, 'services_type_id')->widget(Select2::classname(), [
    'data' => ArrayHelper::map(ServicesType::find()->where(['organization_id' => \Yii::$app->user->identity->organization_id])->all(),'services_type_id','services_type'),
    'language' => 'en',
    'options' => ['placeholder' => 'Select a state ...'],
    'pluginOptions' => [
        'allowClear' => true
        ],
    ]) ?>