backend/views/customer/_form.php

    <div class="row">

        <div class="col-md-4">
              <?= $form->field($plotinfo, 'property_id')->dropDownList(
                    ArrayHelper::map(Property::find()->where(['organization_id' => \Yii::$app->user->identity->organization_id])->all(),'property_id','property_name'),
                    [
                        'prompt' => 'Select Service Type',
                        'onchange' => '$.post("index.php?r=plot/list&id='.'"+$(this).val(),function(data){
                            $("#plotownerinfo-plot_no").html(data);

                        });'
                    ]
---
SELECT * FROM `property` WHERE `organization_id`=1