backend/components/MyComponent.php

INSERT INTO `plot_owner_info` (`property_id`, `plot_no`, `customer_id`, `start_date`, `organization_id`) VALUES (24, 13, 88, '2019-9-11', 1)
---
 	public function getinfo($property_id,$plot_no,$start_date,$customer_id)
 	{
 		$connection = Yii::$app->db;
 		$connection->createCommand()->insert('plot_owner_info',
                    [
                        'property_id' => $property_id,
                        'plot_no' => $plot_no,
                        'customer_id' => $customer_id,
                        'start_date'=>$start_date,
                        'organization_id'=>\Yii::$app->user->identity->organization_id,
                    ])->execute();

INSERT INTO `installment` (`property_id`, `installment_type`, `advance_amount`, `total_amount`, `no_of_installments`, `customer_id`, `plot_no`, `organization_id`) VALUES (20, '6 Months', '0', '5000000', 10, 23, 2, 1)
---
 	public function installment($property_id,$Installment_type,$Installment_remaning,$Installment_total,$customer_id,$no_installments,$plot_no)
 	{
 		$connection = Yii::$app->db;
 		$connection->createCommand()->insert('installment',
                    [
                        'property_id' => $property_id,
                        'installment_type' => $Installment_type,
                        'advance_amount' => 0,
                        'total_amount'=>$Installment_total,
                        'no_of_installments' => $no_installments,
                        'customer_id' => $customer_id,
                        'plot_no'=> $plot_no,
                        'organization_id'=>\Yii::$app->user->identity->organization_id,
                    ])->execute();

UPDATE `plot` SET `status`='Sold' WHERE (`property_id`='24') AND (`plot_no`='13')
---
 	public function sold($property_id,$plot_no)
 	{
 		$connection = Yii::$app->db;
 		$condition = ['property_id' => $property_id , 'plot_no' => $plot_no];
 		$connection->createCommand()->update('plot',
                    [
                        'status' => 'Sold',
                    ],$condition)->execute();

INSERT INTO `installment_status` (`installment_id`, `installment_no`, `installment_amount`, `status`, `date`, `paid_date`, `created_by`) VALUES (64, 1, 20000, 0, '2019-09-11', '2019-10-11', '1')
---
 	public function status($installment_id,$noinstallment,$amount,$totalamount,$advanceamount,$installment_type)
 	{
 		$connection = Yii::$app->db;

 		if($advanceamount == 0)
 		{
 			$final_date = strtotime(date('Y-m-d'));
	 		for($i = 1; $i <= $noinstallment ; $i++)
	 		{
	 			if($installment_type == "Monthly")
				 {
				    $final_date = date("Y-m-d", strtotime("+1 month", $final_date));
				 }else if($installment_type == "6 Months")
				 {
				    $final_date = date("Y-m-d", strtotime("+6 month", $final_date));

				 }else if($installment_type == "Yearly")
				 {
				    $final_date = date("Y-m-d", strtotime("+12 month", $final_date));
				 }
	 			$connection->createCommand()->insert('installment_status',
	                    [
	                        'installment_id' => $installment_id,
	                        'installment_no' => $i,
	                        'installment_amount' => $amount,
	                        'status'=>'1',
	                        'date' => date('Y-m-d'),
	                        'paid_date' => $final_date,
	                        'created_by'=>\Yii::$app->user->identity->id,
	                    ])->execute();

INSERT INTO `installment_status` (`installment_id`, `installment_no`, `installment_amount`, `status`, `date`, `paid_date`, `created_by`) VALUES (23, 1, 10000, 0, '2019-09-16', '2020-03-16', '1')
---
			 {
			    $final_date = date("Y-m-d", strtotime("+12 month", $final_date));
			 }
	 		$connection->createCommand()->insert('installment_status',
	                    [
	                        'installment_id' => $installment_id,
	                        'installment_no' => '1',
	                        'installment_amount' => $advanceamount,
	                        'status'=>'0',
	                        'date' => date('Y-m-d'),
	                        'paid_date' => date('Y-m-d'),
	                        'created_by'=>\Yii::$app->user->identity->id,
	                    ])->execute();

INSERT INTO `installment_status` (`installment_id`, `installment_no`, `installment_amount`, `status`, `date`, `paid_date`, `created_by`) VALUES (23, 2, 499000, 1, '2019-09-16', '2020-09-16', '1')
---
				 {
				    $final_date = date("Y-m-d", strtotime("+12 month", $final_date));
				 }
	 			$connection->createCommand()->insert('installment_status',
	                    [
	                        'installment_id' => $installment_id,
	                        'installment_no' => $i,
	                        'installment_amount' => $amount,
	                        'status'=>'1',
	                        'date' => date('Y-m-d'),
	                        'paid_date' => $final_date,
	                        'created_by'=>\Yii::$app->user->identity->id,
	                    ])->execute();