backend/views/installment-payment/_form.php


        <div class="col-md-4">

             <?= $form->field($model, 'customer_id')->widget(Select2::classname(), [
                'data' => ArrayHelper::map(Customer::find()->where(['organization_id' => \Yii::$app->user->identity->organization_id])->all(),'customer_id','name'),
                'language' => 'en',
                'options' => ['placeholder' => 'Select a state ...'],
                'pluginOptions' => [
                    'allowClear' => true
                        ],
                        'pluginEvents' => [
                            "select2:select" => 'function() {
                                $("#installmentpayment-custm_id").attr("value",$(this).val());
                             $.get("installment-payment/property?customer_id='.'"+$(this).val(),function(data){
                                console.log(data);
                                 $("#installmentpayment-property_id").html(data);
                            });
                             }',
                        ]
                    ])
---
SELECT * FROM `customer`